In [1]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [3]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.

In [5]:
import pandas as pd

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
series = pd.Series(my_list)
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
#Q3.Create a Pandas DataFrame that contains the following data:
#Then, print the DataFrame.

In [9]:
import pandas as pd


data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}
df = pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [10]:
#Q4.What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [11]:
#Answer:

# In pandas, a DataFrame is a 2-dimensional labeled data structure with columns of potentially different types.
#It is similar to a spreadsheet or SQL table, or a dictionary of Series objects. 
#It is the most commonly used pandas object for data manipulation and analysis.
# On the other hand, a pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, etc.). 
#The axis labels are collectively referred to as the index. A Series can be seen as a single column of data in a DataFrame, or as a row if the DataFrame is transposed.

In [12]:
import pandas as pd

# Example of a Series
s = pd.Series([1, 2, 3, 4, 5])
print("Series:")
print(s)
print()

# Example of a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}
df = pd.DataFrame(data)
print("DataFrame:")
print(df)

Series:
0    1
1    2
2    3
3    4
4    5
dtype: int64

DataFrame:
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [13]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
#you give an example of when you might use one of these functions?

In [16]:
df.head()  # View the first 5 rows of the DataFrame

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [17]:
df.tail(3)  # View the last 3 rows of the DataFrame

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [19]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [21]:
df.shape

(3, 3)

In [22]:
df.loc[0]  # Select the first row by label
df.iloc[0]  # Select the first row by integer index

Name       Alice
Age           25
Gender    Female
Name: 0, dtype: object

In [24]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [25]:

# Among Series, DataFrame, and Panel, DataFrame is the only mutable data structure.

# Series: A Series is immutable. Once created, you cannot change the values of elements directly. You can only access them or perform operations that return a new Series.

# DataFrame: A DataFrame is mutable. You can modify the values of elements, add or remove columns, or even add or remove rows.

# Panel: Panels have been deprecated in recent versions of pandas and are no longer recommended for general use. But, similar to DataFrames, Panels are mutable.

# However, considering that Panels have been deprecated and DataFrame is the primary data structure used in Pandas for 2-dimensional data, it's essential to focus on DataFrame for most data manipulation tasks.

In [26]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

In [27]:
import pandas as pd

name_series = pd.Series(['Alice', 'Bob', 'Claire'])
age_series = pd.Series([25, 30, 27])
gender_series = pd.Series(['Female', 'Male', 'Female'])

df = pd.DataFrame({
    'Name': name_series,
    'Age': age_series,
    'Gender': gender_series
})

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female